tutorials/preCICE/flap/Fluid/constant/dynamicMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh movingAdaptiveFvMesh;


protectedPatches (flap);

solver      displacementLaplacian;

displacementLaplacianCoeffs
{
    diffusivity quadratic inverseDistance (flap);
}
errorEstimator delta;      // Model used to estimate error
deltaField p;               // Field used to estimate error
epsilon 0.5;                // Error coefficient

beginUnrefine 1e-6;         // At what time does unrefinement start (default is 0)


balance no;

// How often to refine
refineInterval  2;

// Field to be refinement on
field           error;

// Refine field in between lower..upper (varies based on errorEstimator)
lowerRefineLevel 0.1;
upperRefineLevel 1e6;       // Should be very high for adaptiveFvMesh

// If value < unrefineLevel unrefine
unrefineLevel   0.1;

// Number of cells refined around high error cells
nBufferLayers   1;

// Refine cells only up to maxRefinement levels
maxRefinement   3;

// Stop refinement if maxCells reached
maxCells        100000000;

// Flux field and corresponding velocity field. Fluxes on changed
// faces get recalculated by interpolating the velocity. Use 'none'
// on surfaceScalarFields that do not need to be reinterpolated.
correctFluxes
(
    (phi none)
    (own none)
    (nei none)
    (rhoPhi none)
    (rhoPhi none)
    (rhoEPhi none)
    (rhoUPhi none)
);

// Write the refinement level as a volScalarField
dumpLevel       true;
