tutorials/preCICE/flap/Fluid/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (c4 air);   // List of phases

c4
{
    type detonating;
    reactants
    {
        thermoType
        {
            transport   const;
            thermo      eConst;
            equationOfState Murnaghan;
        }
        equationOfState
        {
            rho0            1601;
            n               7.4;
            kappa           3.9e11;
            Gamma           0.35;
            pRef            101298;
        }
        specie
        {
            molWeight       222.12;
        }
        transport
        {
            mu              1.81e-5;              // Viscosity
            Pr              1;              // Prandtl number
        }
        thermodynamics
        {
            Cv              1000;           // Heat capacity
            Hf              0.0;
        }
    }
    products
    {
        thermoType
        {
            transport   const;
            thermo      eConst;
            equationOfState JWL;
        }
        equationOfState
        {
            rho0      1601;
            A         609.77e9;
            B         12.95e9;
            R1        4.50;
            R2        1.4;
            omega     0.25;
        }
        specie
        {
            molWeight       55.0;
        }
        transport
        {
            mu              1.81e-5;              // Viscosity
            Pr              1;              // Prandtl number
        }
        thermodynamics
        {
            Cv              850;           // Heat capacity
            Hf              0.0;
        }
    }

    activationModel linear;
    initiation
    {
        E0              9.0e9;

        I               4.0e6;
        a               0.0367;
        b               0.667;
        x               7.0;
        maxLambdaI      0.022;

        G1              1.4997e-9;
        c               0.667;
        d               0.33;
        y               2.0;
        minLambda1      0.022;

        G2              0.0;
        e               0.667;
        f               0.667;
        z               3.0;
        minLambda2      0.022;

        pMin            101360;  // Above this pressure activation is                                    // "turned on" [Pa]

        points     ((-1 0.15 0.5));     // Detonation points
        vDet       7850;            // Detonation velocity [m/s]

        ALow        6.25e10;
        TaLow       7216;
        Ts          2000;
        AHigh       1e-2;
        TaHigh      2742;
        dp          1e-6;
    }

    residualRho     1e-6;           // Minimum density of the phase
    residualAlpha   1e-6;          // Minimum volume fraction used for division
}

air
{
    type basic;
    thermoType
    {
        transport   const;
        thermo      eConst;
        equationOfState idealGas;
    }
    equationOfState
    {
        gamma           1.4;            // Heat capactiy ratio
        a               0;
    }
    specie
    {
        molWeight       28.97;
    }
    transport
    {
        mu              1.81e-5;
        Pr              1;
    }
    thermodynamics
    {
        Cv          718;
        Hf          0;
    }

    residualRho     1e-6;
    residualAlpha   1e-6;
}

// ************************************************************************* //
