tutorials/preCICE/flap/Fluid/system/fvSchemes
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fluxScheme AUSM+;

ddtSchemes
{
    default         Euler;
    timeIntegrator  RK2SSP;
}

gradSchemes
{
    default         cellMDLimited leastSquares 1.0;
}

divSchemes
{
    default         none;
    div(tauMC) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         cubic;
    reconstruct(alpha)  vanLeer;
    reconstruct(rho)    vanLeer;
    reconstruct(U)      vanLeerV;
    reconstruct(e)      vanLeer;
    reconstruct(p)      vanLeer;
    reconstruct(c)      vanLeer;

    "reconstruct(.*)"   vanLeer;
}

snGradSchemes
{
    default         corrected;
}


// ************************************************************************* //
