tutorials/preCICE/flap/Fluid/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fields (alpha.c4);
nBufferLayers 2;

defaultFieldValues
(
    volScalarFieldValue alpha.c4    0
    volVectorFieldValue U (0 0 0)
);


regions
(
    cylinderToCell
    {
        points ((-1 0.15 0.5));
        p1 (-1 -1 0.5);
        p2 (-1 1 0.5);
        radius 0.025;
        backup
        {
            p1 (-1 -1 0.5);
        p2 (-1 1 0.5);
            radius 0.1;
        }
        refineInternal yes;
        level 4;

        fieldValues
        (
            volScalarFieldValue alpha.c4    1
        );
    }
    patchToFace
    {
        name flap;
        level 3;
        refineFaces yes;
    }
);


// ************************************************************************* //
